In [1]:
import pandas as pd

# import data
df = pd.read_csv('raw_data.csv')
df

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
1    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
3    3          Alex   NaN     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN
5    5        Li Wei  27.0   China     Male  51000.0
6    6           NaN  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0

In [2]:
# groupby(): Splits the DataFrame into groups based on the values of one or more columns.
# agg(): Aggregates each group using one or more summary/statistical functions.


# Group by 'country'
df.groupby('country')["income"].mean()  # Average income per country
df.groupby('country')["income"].min()   # Minimum income per country
df.groupby('country')["income"].max()   # Maximum income per country


# Group by 'gender' and calculate mean income
df.groupby("gender")["income"].mean()         # Direct aggregation
df.groupby("gender")["income"].agg("mean")    # using agg()

gender
Female     65666.666667
Male       54800.000000
Unknown    47000.000000
Name: income, dtype: float64

In [3]:
# Group by 'gender'

#  Multiple aggregations on 'income' for each gender
df.groupby("gender")["income"].agg(["mean", "min", "max"])  # Mean, min, max

# Named aggregation
df.groupby("gender")["income"].agg(
    avg_salary="mean",   # Average salary
    min_salary="min",    # Minimum salary
    max_salary="max"     # Maximum salary
)

           avg_salary  min_salary  max_salary
gender
Female   65666.666667     62000.0     73000.0
Male     54800.000000     45000.0     68000.0
Unknown  47000.000000     47000.0     47000.0

In [4]:
# Group by 'country'

# Dictionary aggregation: multiple columns with multiple functions
df.groupby("country").agg({
    "income": ["mean", "max"],  # Mean and max income
    "id": "count"               # Number of employees per country
})

# Named aggregation with single function per column
df.groupby("country").agg(
    EMP_Count = ("id", "count"),      # Count of employees
    Min_Salary= ("income", "mean")    # Average income renamed as Min_Salary
)

         EMP_Count  Min_Salary
country
Canada           1     62000.0
China            1     51000.0
India            1     73000.0
Mexico           1     45000.0
Spain            1         NaN
USA              5     55400.0